Tekla Open API Reference for Tekla Structures 2025
CloudAttributes Constructor
Overload List
Name | Description
Cloud.CloudAttributes()
 Creates a new default cloud attributes instance that loads standard attributes.
Cloud.CloudAttributes(String)
 Creates a new cloud attributes instance that loads the specified attributes.
Top
See Also
Reference
Cloud.CloudAttributes Class
Tekla.Structures.Drawing Namespace